app/views/tasks/_task_list.html.haml

            %strong= task.title
          %td.text-info= task.created_at
---
INSERT INTO "tasks" ("created_at", "note", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-12 13:44:04.755330"], ["note", ""], ["title", "fifth"], ["updated_at", "2015-01-12 13:44:04.755330"]]