app/controllers/tasks_controller.rb

  def create
    @task = Task.create(task_params)
    @tasks = Task.all
---
INSERT INTO "tasks" ("created_at", "note", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-12 13:02:36.601844"], ["note", "Created from UI"], ["title", "This is second task"], ["updated_at", "2015-01-12 13:02:36.601844"]]
SELECT "tasks".* FROM "tasks"

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
    @tasks= Task.all
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 6]]
SELECT "tasks".* FROM "tasks"